# FailedToSetWorkplane Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ImportFailures..::..FailedToSetWorkplane Property
BuiltInFailures..::..ImportFailures Class See Also
---
Could not set Work Plane of [Import].\n\nPlease use the Work Plane tool to set a Work Plane for this view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FailedToSetWorkplane { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FailedToSetWorkplane As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FailedToSetWorkplane {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ImportFailures Class
Autodesk.Revit.DB Namespace